# Lecture 14: GNIS

In [1]:
import numpy as np
import pandas as pd

Load the baseball database if you need to

In [2]:
!unzip -u ../../proj/proj2/data/baseball.zip -d data/
!psql postgresql://jovyan@127.0.0.1:5432/baseball -c 'SELECT pg_terminate_backend(pg_stat_activity.pid) FROM pg_stat_activity WHERE datname = current_database()  AND pid <> pg_backend_pid();'
!psql -h localhost -c 'DROP DATABASE IF EXISTS baseball'
!psql -h localhost -c 'CREATE DATABASE baseball'
!psql -h localhost -d baseball -f data/baseball.sql
!psql -h localhost -c 'SET max_parallel_workers_per_gather = 0;'

Archive:  ../../proj/proj2/data/baseball.zip
 pg_terminate_backend
----------------------
(0 rows)

DROP DATABASE
CREATE DATABASE
SET
SET
SET
SET
SET
 set_config
------------

(1 row)

SET
SET
SET
SET
SET
SET
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
COPY 5219
COPY 104256
COPY 179
COPY 6236
COPY 425
COPY 6879
COPY 104324
COPY 13943
COPY 17350
COPY 138838
COPY 12028
COPY 31955
COPY 13110
COPY 4191
COPY 3040
COPY 3469
COPY 93
COPY 252
COPY 19370
COPY 45806
COPY 5445
COPY 26428
COPY 1207
COPY 325
COPY 2865
COPY 120
COPY 52
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
ALTER TABLE
SET

---

# Scalar Functions and Query Plans

In [3]:
## we'll use the Lahman baseball database in our examples today.
## replace the database connection with a database of your own!
%reload_ext sql
%sql postgresql://localhost:5432/baseball
%config SqlMagic.displaylimit = 20

In [4]:
%%sql
WITH yearnum AS
  (SELECT yearid, (yearid % 100) as year
     FROM batting
  )
SELECT yearid, CONCAT('''', LPAD(year::text, 2, '0')) as year
  FROM yearnum
 LIMIT 5;

Running query in 'postgresql://localhost:5432/baseball'

5 rows affected.

+--------+------+
| yearid | year |
+--------+------+
|  1871  | '71  |
|  1871  | '71  |
|  1871  | '71  |
|  1871  | '71  |
|  1871  | '71  |
+--------+------+

Let's analyze the below query (we've flattened it for convenience):

In [5]:
%%sql
EXPLAIN (VERBOSE true)
SELECT yearid,
       CONCAT('''', LPAD((yearid % 100)::text, 2, '0')) AS year
FROM batting;

Running query in 'postgresql://localhost:5432/baseball'

2 rows affected.

+----------------------------------------------------------------------------+
|                                 QUERY PLAN                                 |
+----------------------------------------------------------------------------+
|   Seq Scan on public.batting  (cost=0.00..3927.29 rows=104324 width=36)    |
|   Output: yearid, concat('''', lpad(((yearid % 100))::text, 2, '0'::text)) |
+----------------------------------------------------------------------------+

What if scalar functions mention multiple tables?

The below query computes an arbitrary statistic for pitchers:
* 1 point for every strikeout they throw as pitcher
* â€“1 for every point they themselves struck out as batter

If the notebook-like output is hard to read, try out the query in `psql`. Note that notebooks don't preserve whitespace when displaying dataframes.

In [6]:
%%sql
EXPLAIN (VERBOSE true)
SELECT p.playerid, p.so - b.so
  FROM pitching p
  INNER JOIN batting b
  ON p.playerid=b.playerid;

Running query in 'postgresql://localhost:5432/baseball'

11 rows affected.

+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                           QUERY PLAN                                                                                                           |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                    Nested Loop  (cost=0.43..12974.01 rows=339929 width=13)                                                                                     |
|                                                                                                Output: p.playerid, (p.so - b.so)                                                                                               |
|                                                                           ->  Seq Scan on public.pitching p  (cost=0.00..1374.06 rows=45806 width=13)                                                                          |
|         Output: p.playerid, p.yearid, p.stint, p.teamid, p.lgid, p.w, p.l, p.g, p.gs, p.cg, p.sho, p.sv, p.ipouts, p.h, p.er, p.hr, p.bb, p.so, p.baopp, p.era, p.ibb, p.wp, p.hbp, p.bk, p.bfp, p.gf, p.r, p.sh, p.sf, p.gidp |
|                                                                                          ->  Memoize  (cost=0.43..0.73 rows=7 width=13)                                                                                        |
|                                                                                                        Output: b.so, b.playerid                                                                                                |
|                                                                                                         Cache Key: p.playerid                                                                                                  |
|                                                                                                          Cache Mode: logical                                                                                                   |
|                                                                        ->  Index Scan using batting_pkey on public.batting b  (cost=0.42..0.72 rows=7 width=13)                                                                |
|                                                                                                           Output: b.so, b.playerid                                                                                             |
|                                                                                            Index Cond: ((b.playerid)::text = (p.playerid)::text)                                                                               |
+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

### Window Functions

In [7]:
%%sql
SELECT namefirst, namelast, yearid, HR,
       rank() OVER (ORDER BY HR DESC),
       avg(HR)    OVER (PARTITION BY b.playerid ORDER BY yearid ROWS 3 PRECEDING) as avg_3yr,
       lag(HR, 7) OVER (PARTITION BY b.playerid ORDER BY yearid) as previous,
       lag(HR, 2) OVER (PARTITION BY b.playerid ORDER BY yearid) as lag2
FROM batting b, people m
WHERE m.playerid = b.playerid
   AND (namelast = 'Bonds' or namelast = 'Ruth')
ORDER BY HR DESC
LIMIT 10;

Running query in 'postgresql://localhost:5432/baseball'

10 rows affected.

+-----------+----------+--------+----+------+---------------------+----------+------+
| namefirst | namelast | yearid | hr | rank |       avg_3yr       | previous | lag2 |
+-----------+----------+--------+----+------+---------------------+----------+------+
|   Barry   |  Bonds   |  2001  | 73 |  1   | 48.2500000000000000 |    37    |  34  |
|    Babe   |   Ruth   |  1927  | 60 |  2   | 44.5000000000000000 |    54    |  25  |
|    Babe   |   Ruth   |  1921  | 59 |  3   | 38.2500000000000000 |    0     |  29  |
|    Babe   |   Ruth   |  1920  | 54 |  4   | 24.0000000000000000 |   None   |  11  |
|    Babe   |   Ruth   |  1928  | 54 |  4   | 46.5000000000000000 |    59    |  47  |
|   Barry   |  Bonds   |  2000  | 49 |  6   | 40.0000000000000000 |    46    |  37  |
|    Babe   |   Ruth   |  1930  | 49 |  6   | 52.2500000000000000 |    41    |  54  |
|    Babe   |   Ruth   |  1926  | 47 |  8   | 39.7500000000000000 |    29    |  46  |
|   Barry   |  Bonds   |  1993  | 46 |  9   | 34.5000000000000000 |    16    |  25  |
|   Barry   |  Bonds   |  2002  | 46 |  9   | 50.5000000000000000 |    33    |  49  |
+-----------+----------+--------+----+------+---------------------+----------+------+

### Inverse Distribution Window Functions

In [8]:
%%sql
SELECT MIN(HR),
       percentile_cont(0.25) WITHIN GROUP (ORDER BY HR) AS p25,
       percentile_cont(0.50) WITHIN GROUP (ORDER BY HR) AS median,
       percentile_cont(0.75) WITHIN GROUP (ORDER BY HR) AS p75,
       percentile_cont(0.99) WITHIN GROUP (ORDER BY HR) AS p99,
       MAX(HR),
       AVG(HR)
FROM batting;

Running query in 'postgresql://localhost:5432/baseball'

1 rows affected.

+-----+-----+--------+-----+------+-----+--------------------+
| min | p25 | median | p75 | p99  | max |        avg         |
+-----+-----+--------+-----+------+-----+--------------------+
|  0  | 0.0 |  0.0   | 2.0 | 31.0 |  73 | 2.8315823779763046 |
+-----+-----+--------+-----+------+-----+--------------------+

In [9]:
%%sql
SELECT HR, COUNT(*) FROM batting GROUP BY HR ORDER BY HR;

Running query in 'postgresql://localhost:5432/baseball'

67 rows affected.

+----+-------+
| hr | count |
+----+-------+
| 0  | 63825 |
| 1  |  9953 |
| 2  |  5531 |
| 3  |  3806 |
| 4  |  2790 |
| 5  |  2212 |
| 6  |  1825 |
| 7  |  1533 |
| 8  |  1330 |
| 9  |  1147 |
| 10 |  949  |
| 11 |  861  |
| 12 |  868  |
| 13 |  685  |
| 14 |  654  |
| 15 |  578  |
| 16 |  549  |
| 17 |  474  |
| 18 |  460  |
| 19 |  346  |
+----+-------+
Truncated to displaylimit of 20.

### Hypothetical-Set Window Functions

In [10]:
hrs = 4 # hypothetically, four home runs

In [11]:
%%sql
SELECT {{hrs}} as hypothetical,
       rank({{hrs}}) WITHIN GROUP (ORDER BY HR DESC),
       dense_rank({{hrs}}) WITHIN GROUP (ORDER BY HR DESC),
       percent_rank({{hrs}}) WITHIN GROUP (ORDER BY HR DESC) * 100 AS pct_rank,
       cume_dist({{hrs}}) WITHIN GROUP (ORDER BY HR)
FROM batting
LIMIT 10;

Running query in 'postgresql://localhost:5432/baseball'

1 rows affected.

+--------------+-------+------------+--------------------+-------------------+
| hypothetical |  rank | dense_rank |      pct_rank      |     cume_dist     |
+--------------+-------+------------+--------------------+-------------------+
|      4       | 18420 |     63     | 17.655573022506807 | 0.823445962137551 |
+--------------+-------+------------+--------------------+-------------------+

Without `jupysql` variable substituion

In [ ]:
%%sql
SELECT 4 as hypothetical,
       rank(4) WITHIN GROUP (ORDER BY HR DESC),
       dense_rank(4) WITHIN GROUP (ORDER BY HR DESC),
       percent_rank(4) WITHIN GROUP (ORDER BY HR DESC) * 100 AS pct_rank,
       cume_dist(4) WITHIN GROUP (ORDER BY HR)
FROM batting
LIMIT 10;

# GNIS

This notebook transforms the existing [Geographics Names Information Systems (GNIS)](https://www.usgs.gov/core-science-systems/ngp/board-on-geographic-names/download-gnis-data) national zip file.

We have provided a subset of the sql database for you in `data/national.sql`.

If you'd like to make your own version of this database, see the end of this notebook. Note: Because of its size, we don't recommend building the GNIS SQL database from scratch on DataHub.

In [12]:
!psql -h localhost -d gnis -c 'SELECT pg_terminate_backend(pg_stat_activity.pid) FROM pg_stat_activity WHERE datname = current_database() AND pid <> pg_backend_pid();'
!psql -h localhost -c 'DROP DATABASE IF EXISTS gnis'
!psql -h localhost -c 'CREATE DATABASE gnis' 
!psql -h localhost -d gnis -f data/gnis.sql

 pg_terminate_backend
----------------------
(0 rows)

DROP DATABASE
CREATE DATABASE
SET
SET
SET
SET
SET
 set_config
------------

(1 row)

SET
SET
SET
SET
SET
SET
CREATE TABLE
ALTER TABLE
CREATE TABLE
ALTER TABLE
COPY 3195
COPY 11533
CREATE INDEX

In [13]:
%reload_ext sql
%sql postgresql://localhost:5432/gnis
%config SqlMagic.displaylimit = 15
%config SqlMagic.named_parameters=True

Connecting and switching to connection postgresql://localhost:5432/gnis

* View schema in `psql`
* View some rows below

In [14]:
%sql SELECT COUNT(*) FROM national;

Running query in 'postgresql://localhost:5432/gnis'

1 rows affected.

+-------+
| count |
+-------+
| 11533 |
+-------+

In [15]:
%sql SELECT * FROM national WHERE county_name = 'Alameda';

Running query in 'postgresql://localhost:5432/gnis'

21 rows affected.

+------------+------------------------------------------+---------------+-------------+---------------+-------------+----------------+-----------------+---------------+--------------+---------------+----------------+-----------------+----------------+-----------------+-----------+------------+-----------------+--------------+-------------+
| feature_id |               feature_name               | feature_class | state_alpha | state_numeric | county_name | county_numeric | primary_lat_dms | prim_long_dms | prim_lat_dec | prim_long_dec | source_lat_dms | source_long_dms | source_lat_dec | source_long_dec | elev_in_m | elev_in_ft |     map_name    | date_created | date_edited |
+------------+------------------------------------------+---------------+-------------+---------------+-------------+----------------+-----------------+---------------+--------------+---------------+----------------+-----------------+----------------+-----------------+-----------+------------+-----------------+--------------+-------------+
|   218316   |              Apperson Creek              |     Stream    |      CA     |       6       |   Alameda   |      1.0       |     373349N     |    1215000W   |  37.5635453  |  -121.8332887 |    373232N     |     1214804W    |   37.5422222   |   -121.8011111  |   148.0   |   486.0    | La Costa Valley |  01/19/1981  |     None    |
|   225998   |          Irvington High School           |     School    |      CA     |       6       |   Alameda   |      1.0       |     373126N     |    1215801W   |  37.523814   |  -121.9670659 |      None      |       None      |      None      |       None      |    13.0   |    43.0    |      Niles      |  01/19/1981  |  03/31/2021 |
|   226951   |         Laurel Elementary School         |     School    |      CA     |       6       |   Alameda   |      1.0       |     374734N     |    1221147W   |  37.792899   |  -122.1964288 |      None      |       None      |      None      |       None      |    68.0   |   223.0    |   Oakland East  |  06/14/2000  |  03/14/2021 |
|   229367   |         Murray Elementary School         |     School    |      CA     |       6       |   Alameda   |      1.0       |     374318N     |    1215557W   |  37.721801   |  -121.9326269 |      None      |       None      |      None      |       None      |   112.0   |   367.0    |      Dublin     |  01/19/1981  |  03/14/2021 |
|   235581   |             Strawberry Creek             |     Stream    |      CA     |       6       |   Alameda   |      1.0       |     375221N     |    1221443W   |  37.8724258  |  -122.2452464 |    375251N     |     1221354W    |   37.8807588   |   -122.2316349  |   154.0   |   505.0    |   Oakland East  |  01/19/1981  |  08/31/2016 |
|  1654274   |           Hayward Golf Course            |     Locale    |      CA     |       6       |   Alameda   |      1.0       |     373726N     |    1220250W   |  37.6238222  |  -122.0471843 |      None      |       None      |      None      |       None      |    5.0    |    16.0    |      Newark     |  01/19/1981  |     None    |
|  1664964   |           KOFY-AM (San Mateo)            |     Tower     |      CA     |       6       |   Alameda   |      1.0       |     374934N     |    1221842W   |  37.8260385  |  -122.3116366 |      None      |       None      |      None      |       None      |    2.0    |    7.0     |   Oakland West  |  07/01/1994  |     None    |
|  1670278   |              Lake Elizabeth              |      Lake     |      CA     |       6       |   Alameda   |      1.0       |     373255N     |    1215742W   |  37.5487056  |  -121.9617554 |      None      |       None      |      None      |       None      |    16.0   |    52.0    |      Niles      |  11/09/1995  |  03/07/2019 |
|  1692819   | California School for the Deaf - Fremont |     School    |      CA     |       6       |   Alameda   |      1.0       |     373334N     |    1215747W   |  37.5593966  |  -121.9631843 |      None      |       None      |      None      |       None      |    20.0   |    66.0    |      Niles      |  05/08/1996  |  09/16/2016 |
|  1692863   |           J A Freitas Library            |    Building   |      CA     |       6       |   Alameda   |      1.0       |     374335N     |    1220925W   |  37.7263185  |  -122.1569101 |      None      |       None      |      None      |       None      |    19.0   |    62.0    |   San Leandro   |  05/08/1996  |     None    |
|  1693010   |            Alice Arts Center             |    Building   |      CA     |       6       |   Alameda   |      1.0       |     374812N     |    1221557W   |  37.8032611  |  -122.2658025 |      None      |       None      |      None      |       None      |    11.0   |    36.0    |   Oakland West  |  05/08/1996  |     None    |
|  1961816   |    New Pilgrim Congregational Church     |     Church    |      CA     |       6       |   Alameda   |      1.0       |     374622N     |    1221131W   |  37.7727061  |  -122.1919115 |      None      |       None      |      None      |       None      |    21.0   |    69.0    |   Oakland East  |  09/11/2002  |     None    |
|  1961871   |      First Southern Baptist Church       |     Church    |      CA     |       6       |   Alameda   |      1.0       |     374657N     |    1221401W   |  37.7824282  |  -122.2335796 |      None      |       None      |      None      |       None      |    11.0   |    36.0    |   Oakland East  |  09/11/2002  |     None    |
|  1962002   |     First Church of Christ Scientist     |     Church    |      CA     |       6       |   Alameda   |      1.0       |     374353N     |    1220931W   |  37.7313183  |  -122.1585769 |      None      |       None      |      None      |       None      |    19.0   |    62.0    |   San Leandro   |  09/11/2002  |     None    |
|  2087391   |        First Presbyterian Church         |     Church    |      CA     |       6       |   Alameda   |      1.0       |     373254N     |    1220238W   |  37.5483333  |  -122.0438889 |      None      |       None      |      None      |       None      |    7.0    |    23.0    |      Newark     |  05/22/2006  |     None    |
+------------+------------------------------------------+---------------+-------------+---------------+-------------+----------------+-----------------+---------------+--------------+---------------+----------------+-----------------+----------------+-----------------+-----------+------------+-----------------+--------------+-------------+
Truncated to displaylimit of 15.

In [16]:
%%sql
SELECT *
FROM national TABLESAMPLE BERNOULLI(10);

Running query in 'postgresql://localhost:5432/gnis'

1188 rows affected.

+------------+--------------------------+-----------------+-------------+---------------+-------------+----------------+-----------------+---------------+--------------+---------------+----------------+-----------------+----------------+-----------------+-----------+------------+---------------------+--------------+-------------+
| feature_id |       feature_name       |  feature_class  | state_alpha | state_numeric | county_name | county_numeric | primary_lat_dms | prim_long_dms | prim_lat_dec | prim_long_dec | source_lat_dms | source_long_dms | source_lat_dec | source_long_dec | elev_in_m | elev_in_ft |       map_name      | date_created | date_edited |
+------------+--------------------------+-----------------+-------------+---------------+-------------+----------------+-----------------+---------------+--------------+---------------+----------------+-----------------+----------------+-----------------+-----------+------------+---------------------+--------------+-------------+
|    2336    | Cabeza Prieta Game Range |       Park      |      AZ     |       4       |     Yuma    |      27.0      |     321500N     |    1132703W   |  32.250056   |   -113.45074  |      None      |       None      |      None      |       None      |   275.0   |   902.0    |   Bryan Mountains   |  02/08/1980  |     None    |
|    2750    |     Chandler Springs     |      Spring     |      AZ     |       4       |    Navajo   |      17.0      |     352236N     |    1102831W   |  35.3766788  |  -110.4754096 |      None      |       None      |      None      |       None      |   1685.0  |   5528.0   |     Shonto Butte    |  02/08/1980  |     None    |
|    4568    |       Fence Ridge        |      Ridge      |      AZ     |       4       |   Coconino  |      5.0       |     362432N     |    1121843W   |  36.408961   |  -112.3120056 |      None      |       None      |      None      |       None      |   2434.0  |   7985.0   |      Timp Point     |  02/08/1980  |  05/06/2017 |
|    7733    |      Martin Lateral      |      Canal      |      AZ     |       4       |     Yuma    |      27.0      |     323918N     |    1144003W   |  32.6550495  |  -114.6674537 |      None      |       None      |      None      |       None      |    36.0   |   118.0    |      Yuma West      |  02/08/1980  |     None    |
|   10399    |         Rock Gap         |       Gap       |      AZ     |       4       |    Navajo   |      17.0      |     363520N     |    1101319W   |  36.5888881  |  -110.2220747 |      None      |       None      |      None      |       None      |   2251.0  |   7385.0   |      Owl Spring     |  02/08/1980  |     None    |
|   10540    |   Round Rock Reservoir   |    Reservoir    |      AZ     |       4       |    Apache   |      1.0       |     362909N     |    1092659W   |  36.4858103  |  -109.4495897 |      None      |       None      |      None      |       None      |   1679.0  |   5508.0   |   Fire Dance Mesa   |  02/08/1980  |  02/13/2019 |
|   12390    |        Long Logs         |       Area      |      AZ     |       4       |    Apache   |      1.0       |     344838N     |    1095112W   |  34.8105857  |  -109.853447  |      None      |       None      |      None      |       None      |   1680.0  |   5512.0   |     Agate House     |  02/08/1980  |     None    |
|   21298    |      Jackass Basin       |      Basin      |      AZ     |       4       |   Yavapai   |      25.0      |     345414N     |    1131359W   |  34.9039033  |  -113.2329786 |      None      |       None      |      None      |       None      |   1653.0  |   5423.0   |     Sunrise Peak    |  06/27/1984  |     None    |
|   24170    |       Checker Tank       |    Reservoir    |      AZ     |       4       |     Gila    |      7.0       |     335532N     |    1103555W   |  33.9256045  |  -110.5987232 |      None      |       None      |      None      |       None      |   1594.0  |   5230.0   | Blue House Mountain |  06/27/1984  |     None    |
|   26578    |       Boggy Creek        |      Stream     |      AZ     |       4       |    Apache   |      1.0       |     334431N     |    1092623W   |  33.741996   |  -109.4398075 |    334921N     |     1092932W    |   33.8225501   |   -109.4923107  |   2303.0  |   7556.0   |     Hoodoo Knoll    |  02/08/1980  |     None    |
|   31803    |  Middle Cottonwood Tank  |    Reservoir    |      AZ     |       4       |    Navajo   |      17.0      |     341127N     |    1100920W   |  34.1909554  |  -110.1556588 |      None      |       None      |      None      |       None      |   1925.0  |   6316.0   |   Red Top Mountain  |  02/08/1980  |  03/19/2019 |
|   32665    |      Papago Spring       |      Spring     |      AZ     |       4       |     Pima    |      19.0      |     320458N     |    1103459W   |  32.0828572  |  -110.5831351 |      None      |       None      |      None      |       None      |   1192.0  |   3911.0   |     Rincon Peak     |  02/08/1980  |     None    |
|   34893    |   Strawberry Mountain    |      Summit     |      AZ     |       4       |     Gila    |      7.0       |     342256N     |    1112914W   |  34.382223   |  -111.4873448 |      None      |       None      |      None      |       None      |   2086.0  |   6844.0   |         Pine        |  02/08/1980  |  03/09/2021 |
|   39068    |      Lee Valley Dam      |       Dam       |      AZ     |       4       |    Apache   |      1.0       |     335630N     |    1092956W   |  33.9417151  |  -109.4989794 |      None      |       None      |      None      |       None      |   2870.0  |   9416.0   |    Big Lake North   |  06/27/1984  |     None    |
|   40781    |    Hunter Creek Ranch    | Populated Place |      AZ     |       4       |     Gila    |      7.0       |     341815N     |    1110040W   |  34.3042039  |  -111.0112406 |      None      |       None      |      None      |       None      |   1786.0  |   5860.0   |   Promontory Butte  |  05/01/1991  |     None    |
+------------+--------------------------+-----------------+-------------+---------------+-------------+----------------+-----------------+---------------+--------------+---------------+----------------+-----------------+----------------+-----------------+-----------+------------+---------------------+--------------+-------------+
Truncated to displaylimit of 15.

# Numerical Granularity

In [17]:
%sql SELECT elev_in_m FROM National LIMIT 2;

Running query in 'postgresql://localhost:5432/gnis'

2 rows affected.

+-----------+
| elev_in_m |
+-----------+
|   931.0   |
|   2707.0  |
+-----------+

In [18]:
%%sql
SELECT elev_in_m, 
    (elev_in_m / 100) :: INTEGER AS quantized,
    ((elev_in_m / 100) :: INTEGER) * 100 AS round_to_100,
    SUBSTRING(elev_in_m :: TEXT, 1, 2),
    CONCAT(SUBSTRING(elev_in_m :: TEXT, 1, 2), '00') AS substring2
FROM National
LIMIT 5;

Running query in 'postgresql://localhost:5432/gnis'

5 rows affected.

+-----------+-----------+--------------+-----------+------------+
| elev_in_m | quantized | round_to_100 | substring | substring2 |
+-----------+-----------+--------------+-----------+------------+
|   931.0   |     9     |     900      |     93    |    9300    |
|   2707.0  |     27    |     2700     |     27    |    2700    |
|   275.0   |     3     |     300      |     27    |    2700    |
|   1685.0  |     17    |     1700     |     16    |    1600    |
|   1354.0  |     14    |     1400     |     13    |    1300    |
+-----------+-----------+--------------+-----------+------------+

In [ ]:
%%sql
/* does not run in jupysql b/c of <<. copy into psql  */
SELECT elev_in_m,
    (16::INTEGER::BIT(12)) AS bit12, 
    (16::INTEGER::BIT(12)) << 3
FROM national
LIMIT 5;

In [ ]:
%%sql
EXPLAIN (verbose)
WITH shifts AS (
SELECT elev_in_m, 
       (elev_in_m::integer::bit(12)) AS bit12, 
       (elev_in_m::integer::bit(12) >> 8) AS rightshifted, 
       ((elev_in_m::integer::bit(12) >> 8) << 8)::integer AS round_to_256,
       ((elev_in_m::integer::bit(12) >> 8) << 8)::integer % 256 AS test
  FROM national
)
SELECT COUNT(DISTINCT elev_in_m) AS elevation_meters_count,
       COUNT(DISTINCT bit12) AS bit12_count,
       COUNT(DISTINCT rightshifted) AS rightshift_count,
       COUNT(DISTINCT round_to_256) AS rounded_count
  FROM shifts;

# Demo 1: Roll-up / Drill-down Practice

Let's start with county-level data on elevations:

In [19]:
%%sql
SELECT state_numeric, county_numeric,
       avg(elev_in_m),
       stddev(elev_in_m), count(*)
FROM national TABLESAMPLE BERNOULLI(10)
GROUP BY state_numeric, county_numeric;

Running query in 'postgresql://localhost:5432/gnis'

888 rows affected.

+---------------+----------------+--------+--------------------+-------+
| state_numeric | county_numeric |  avg   |       stddev       | count |
+---------------+----------------+--------+--------------------+-------+
|       13      |      99.0      |  64.0  |        None        |   1   |
|       56      |      35.0      | 2117.0 |        None        |   1   |
|       1       |      33.0      | 132.0  |        None        |   1   |
|       34      |      39.0      | 123.0  |        None        |   1   |
|       53      |      37.0      | 1506.0 | 721.2489168102785  |   2   |
|       46      |      47.0      | 990.0  |        None        |   1   |
|       37      |     139.0      |  1.0   |        None        |   1   |
|       36      |      65.0      | 202.0  | 25.45584412271571  |   2   |
|       29      |      31.0      | 103.0  |        None        |   1   |
|       20      |      55.0      | 748.0  |        None        |   1   |
|       45      |      45.0      | 258.0  |        None        |   1   |
|       13      |     153.0      | 135.0  |        None        |   1   |
|       28      |      47.0      |  5.5   | 1.9148542155126762 |   4   |
|       30      |     105.0      | 733.0  | 131.52186130069785 |   2   |
|       51      |     199.0      |  15.0  |        None        |   1   |
+---------------+----------------+--------+--------------------+-------+
Truncated to displaylimit of 15.

**Roll up** to state level.
* We save the view as `state_elevations` for later...

In [20]:
%%sql
DROP VIEW IF EXISTS state_elevations;

CREATE VIEW state_elevations AS
SELECT state_numeric,
       avg(elev_in_m),
       stddev(elev_in_m), count(*)
FROM national 
GROUP BY state_numeric
;

Running query in 'postgresql://localhost:5432/gnis'

++
||
++
++

In [21]:
%sql SELECT * FROM state_elevations;

Running query in 'postgresql://localhost:5432/gnis'

59 rows affected.

+---------------+--------------------+--------------------+-------+
| state_numeric |        avg         |       stddev       | count |
+---------------+--------------------+--------------------+-------+
|       54      | 363.6190476190476  | 199.26650831834746 |  204  |
|       29      | 246.09152542372883 |  80.2483078596168  |  343  |
|       68      | 6.666666666666667  |  7.99166232186187  |   14  |
|       4       | 1315.3798076923076 | 672.6305522946129  |  208  |
|       34      | 40.08943089430894  | 59.88896941733248  |  123  |
|       51      | 254.55197132616487 | 260.54513270095333 |  283  |
|       70      | 18.333333333333332 | 31.75426480542942  |   3   |
|       10      | 22.11111111111111  | 28.015563440198648 |   27  |
|       35      | 1756.8467432950192 | 471.8002505531821  |  273  |
|       45      | 122.83240223463687 | 123.96059930539184 |  181  |
|       6       | 516.7286432160804  |  684.895132373804  |  599  |
|       39      | 262.80258899676375 | 57.78124212343727  |  328  |
|       69      | 90.66666666666667  | 82.82189726555814  |   6   |
|       36      | 217.14150943396226 | 197.0201865875975  |  424  |
|       31      | 628.2797202797203  | 293.8114851587473  |  148  |
+---------------+--------------------+--------------------+-------+
Truncated to displaylimit of 15.

**Drill down** to include feature class.

In [22]:
%%sql
SELECT state_numeric, feature_class,
       avg(elev_in_m),
       stddev(elev_in_m), count(*)
FROM national TABLESAMPLE Bernoulli(10)
GROUP BY state_numeric, feature_class
ORDER BY count(*) DESC;

Running query in 'postgresql://localhost:5432/gnis'

557 rows affected.

+---------------+-----------------+--------------------+--------------------+-------+
| state_numeric |  feature_class  |        avg         |       stddev       | count |
+---------------+-----------------+--------------------+--------------------+-------+
|       1       |      Church     | 132.07692307692307 | 66.96947257079346  |   13  |
|       30      |       Well      |       960.25       | 234.06220035786137 |   12  |
|       13      | Populated Place | 202.45454545454547 | 96.78673838534247  |   11  |
|       6       |      Church     | 63.18181818181818  | 66.54144299880817  |   11  |
|       41      |      Stream     | 422.22222222222223 | 416.49092960644947 |   9   |
|       36      |      Church     | 118.11111111111111 | 104.81465122353416 |   9   |
|       36      | Populated Place | 296.3333333333333  | 239.13385373049965 |   9   |
|       48      |     Building    |      281.375       | 359.5425416911249  |   8   |
|       17      |      School     |      203.125       | 17.971703949741183 |   8   |
|       1       |     Cemetery    |       154.0        |  86.4175908018732  |   8   |
|       29      |      Church     |       172.25       | 73.96113844445608  |   8   |
|       6       |      School     | 76.14285714285714  | 93.44593547684595  |   7   |
|       1       | Populated Place |       129.0        | 75.53586344688638  |   7   |
|       13      |      Stream     | 275.85714285714283 | 236.06314732251099 |   7   |
|       29      |      Stream     | 225.42857142857142 | 85.69491844688953  |   7   |
+---------------+-----------------+--------------------+--------------------+-------+
Truncated to displaylimit of 15.

# Demo 2: Connections to Statistics

## Roll up with marginal distributions

In [23]:
%%sql
SELECT state_numeric,
       AVG(elev_in_m),
       STDDEV(elev_in_m), COUNT(*),
       SUM(COUNT(*)) OVER () AS total,
       COUNT(*)/SUM(COUNT(*)) OVER () AS marginal
FROM national TABLESAMPLE Bernoulli(.07)
GROUP BY state_numeric;

Running query in 'postgresql://localhost:5432/gnis'

4 rows affected.

+---------------+--------+--------+-------+-------+------------------------+
| state_numeric |  avg   | stddev | count | total |        marginal        |
+---------------+--------+--------+-------+-------+------------------------+
|       35      | 1282.0 |  None  |   1   |   4   | 0.25000000000000000000 |
|       39      | 224.0  |  None  |   1   |   4   | 0.25000000000000000000 |
|       41      | 1388.0 |  None  |   1   |   4   | 0.25000000000000000000 |
|       42      | 369.0  |  None  |   1   |   4   | 0.25000000000000000000 |
+---------------+--------+--------+-------+-------+------------------------+

In [24]:
%%sql
SELECT COUNT(DISTINCT county_numeric) FROM national;

Running query in 'postgresql://localhost:5432/gnis'

1 rows affected.

+-------+
| count |
+-------+
|  291  |
+-------+

## Drill down with normally-distributed elevations:

Start with the `state_elevations` view from earlier:

In [25]:
%sql SELECT * FROM state_elevations;

Running query in 'postgresql://localhost:5432/gnis'

59 rows affected.

+---------------+--------------------+--------------------+-------+
| state_numeric |        avg         |       stddev       | count |
+---------------+--------------------+--------------------+-------+
|       54      | 363.6190476190476  | 199.26650831834746 |  204  |
|       29      | 246.09152542372883 |  80.2483078596168  |  343  |
|       68      | 6.666666666666667  |  7.99166232186187  |   14  |
|       4       | 1315.3798076923076 | 672.6305522946129  |  208  |
|       34      | 40.08943089430894  | 59.88896941733248  |  123  |
|       51      | 254.55197132616487 | 260.54513270095333 |  283  |
|       70      | 18.333333333333332 | 31.75426480542942  |   3   |
|       10      | 22.11111111111111  | 28.015563440198648 |   27  |
|       35      | 1756.8467432950192 | 471.8002505531821  |  273  |
|       45      | 122.83240223463687 | 123.96059930539184 |  181  |
|       6       | 516.7286432160804  |  684.895132373804  |  599  |
|       39      | 262.80258899676375 | 57.78124212343727  |  328  |
|       69      | 90.66666666666667  | 82.82189726555814  |   6   |
|       36      | 217.14150943396226 | 197.0201865875975  |  424  |
|       31      | 628.2797202797203  | 293.8114851587473  |  148  |
+---------------+--------------------+--------------------+-------+
Truncated to displaylimit of 15.

The `fips_counties` relation has all counties, including those not in `national`:

In [26]:
%sql SELECT * FROM fips_counties LIMIT 10;

Running query in 'postgresql://localhost:5432/gnis'

10 rows affected.

+------+-----------------+---------------+
| fips |      county     | state_numeric |
+------+-----------------+---------------+
| 1000 |     Alabama     |       1       |
| 1001 |  Autauga County |       1       |
| 1003 |  Baldwin County |       1       |
| 1005 |  Barbour County |       1       |
| 1007 |   Bibb County   |       1       |
| 1009 |  Blount County  |       1       |
| 1011 |  Bullock County |       1       |
| 1013 |  Butler County  |       1       |
| 1015 |  Calhoun County |       1       |
| 1017 | Chambers County |       1       |
+------+-----------------+---------------+

If we wanted to **drill down** to the FIPS counties, we'd need to simulate an elevation for those counties that don't exist in `national`.

Here's the first step in that process, which creates a simulated value for *every* county in `fips_counties`.
* The value is simulated from a normal distribution using that state's elevation statistics (average, standard deviation).
* Just like a Python package, we would need to import `tablefunc` in order to use the `normal_rand` function.

In [27]:
%sql CREATE EXTENSION IF NOT EXISTS tablefunc;

Running query in 'postgresql://localhost:5432/gnis'

++
||
++
++

In [28]:
%%sql
WITH state_cty AS
(SELECT s.state_numeric, f.fips as county_numeric, s.avg, s.stddev, s.count
  FROM state_elevations s, fips_counties f
  WHERE s.state_numeric = f.state_numeric
)
SELECT s.*,
       n.n AS elev_in_m,
       true as elev_in_m_sim -- user-facing flag
  FROM state_cty s,
       LATERAL normal_rand(CAST(s.count AS INTEGER), s.avg, s.stddev) AS n
LIMIT 10;

Running query in 'postgresql://localhost:5432/gnis'

10 rows affected.

+---------------+----------------+--------------------+--------------------+-------+--------------------+---------------+
| state_numeric | county_numeric |        avg         |       stddev       | count |     elev_in_m      | elev_in_m_sim |
+---------------+----------------+--------------------+--------------------+-------+--------------------+---------------+
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  |  98.5190355853754  |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  | 176.78141173238936 |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  | 173.08800652498465 |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  | 131.55886568344636 |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  | 199.05220856686694 |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  | 57.421414206652955 |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  | 150.15944286078695 |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  | 172.26643973504179 |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  |  68.1099349179242  |      True     |
|       1       |      1000      | 146.37888198757764 | 102.92185851771194 |  339  | 221.40240407776193 |      True     |
+---------------+----------------+--------------------+--------------------+-------+--------------------+---------------+

# Assembling an Explicit Hierarchy

In [29]:
## we'll use the Lahman baseball database in our initial examples today.
## replace the database connection with a database of your own!
%reload_ext sql
%sql postgresql://localhost:5432/baseball

Switching to connection postgresql://localhost:5432/baseball

Two relations have the pieces of the hierarchy we want:

In [30]:
%sql SELECT * FROM Appearances WHERE yearid > 1970 LIMIT 2;

Running query in 'postgresql://localhost:5432/baseball'

2 rows affected.

+--------+--------+------+-----------+-------+-----+-----------+-----------+-----+-----+------+------+------+------+------+------+------+------+------+------+------+
| yearid | teamid | lgid |  playerid | g_all |  gs | g_batting | g_defense | g_p | g_c | g_1b | g_2b | g_3b | g_ss | g_lf | g_cf | g_rf | g_of | g_dh | g_ph | g_pr |
+--------+--------+------+-----------+-------+-----+-----------+-----------+-----+-----+------+------+------+------+------+------+------+------+------+------+------+
|  1971  |  ATL   |  NL  | aaronha01 |  139  | 129 |    139    |    129    |  0  |  0  |  71  |  0   |  0   |  0   |  0   |  0   |  60  |  60  |  0   |  10  |  0   |
|  1971  |  ATL   |  NL  | aaronto01 |   25  |  10 |     25    |     18    |  0  |  0  |  11  |  0   |  7   |  0   |  0   |  0   |  0   |  0   |  0   |  8   |  0   |
+--------+--------+------+-----------+-------+-----+-----------+-----------+-----+-----+------+------+------+------+------+------+------+------+------+------+------+

In [31]:
%sql SELECT * FROM Teams LIMIT 1;

Running query in 'postgresql://localhost:5432/baseball'

1 rows affected.

+--------+------+--------+----------+-------+------+----+-------+----+----+--------+-------+-------+-------+-----+------+-----+-----+-----+----+----+----+----+----+------+------+-----+-----+------+----+-----+----+--------+-----+-----+-----+-----+-----+----+-------+----------------------+---------------------+------------+-----+-----+----------+----------------+-------------+
| yearid | lgid | teamid | franchid | divid | rank | g  | ghome | w  | l  | divwin | wcwin | lgwin | wswin |  r  |  ab  |  h  | h2b | h3b | hr | bb | so | sb | cs | hbp  |  sf  |  ra |  er | era  | cg | sho | sv | ipouts |  ha | hra | bba | soa |  e  | dp |   fp  |         name         |         park        | attendance | bpf | ppf | teamidbr | teamidlahman45 | teamidretro |
+--------+------+--------+----------+-------+------+----+-------+----+----+--------+-------+-------+-------+-----+------+-----+-----+-----+----+----+----+----+----+------+------+-----+-----+------+----+-----+----+--------+-----+-----+-----+-----+-----+----+-------+----------------------+---------------------+------------+-----+-----+----------+----------------+-------------+
|  1871  |  NA  |  BS1   |   BNA    |  None |  3   | 31 |  None | 20 | 10 |  None  |  None |   N   |  None | 401 | 1372 | 426 |  70 |  37 | 3  | 60 | 19 | 73 | 16 | None | None | 303 | 109 | 3.55 | 22 |  1  | 3  |  828   | 367 |  2  |  42 |  23 | 243 | 24 | 0.834 | Boston Red Stockings | South End Grounds I |    None    | 103 |  98 |   BOS    |      BS1       |     BS1     |
+--------+------+--------+----------+-------+------+----+-------+----+----+--------+-------+-------+-------+-----+------+-----+-----+-----+----+----+----+----+----+------+------+-----+-----+------+----+-----+----+--------+-----+-----+-----+-----+-----+----+-------+----------------------+---------------------+------------+-----+-----+----------+----------------+-------------+

Let's join these two to make our hierarchy! Which way should we make this?

In [32]:
%%sql
SELECT a.playerid, a.teamid, t.divid, a.*
  FROM Appearances a
  NATURAL JOIN Teams t
WHERE a.yearid = 2015
LIMIT 100;

Running query in 'postgresql://localhost:5432/baseball'

100 rows affected.

+-----------+--------+-------+--------+----------+------+------------+-------+-----+-----------+-----------+-----+-----+------+------+------+------+------+------+------+------+------+------+------+
|  playerid | teamid | divid | yearid | teamid_1 | lgid | playerid_1 | g_all |  gs | g_batting | g_defense | g_p | g_c | g_1b | g_2b | g_3b | g_ss | g_lf | g_cf | g_rf | g_of | g_dh | g_ph | g_pr |
+-----------+--------+-------+--------+----------+------+------------+-------+-----+-----------+-----------+-----+-----+------+------+------+------+------+------+------+------+------+------+------+
| alvarda02 |  BAL   |   E   |  2015  |   BAL    |  AL  | alvarda02  |   12  |  10 |     12    |     12    |  0  |  0  |  0   |  0   |  0   |  0   |  0   |  1   |  12  |  12  |  0   |  0   |  0   |
| brachbr01 |  BAL   |   E   |  2015  |   BAL    |  AL  | brachbr01  |   62  |  0  |     5     |     62    |  62 |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
| brittza01 |  BAL   |   E   |  2015  |   BAL    |  AL  | brittza01  |   64  |  0  |     2     |     64    |  64 |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
| cabrace01 |  BAL   |   E   |  2015  |   BAL    |  AL  | cabrace01  |   2   |  0  |     0     |     2     |  2  |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
| cabreev01 |  BAL   |   E   |  2015  |   BAL    |  AL  | cabreev01  |   29  |  28 |     29    |     28    |  0  |  0  |  0   |  2   |  0   |  27  |  0   |  0   |  0   |  0   |  0   |  0   |  1   |
|  chenwe02 |  BAL   |   E   |  2015  |   BAL    |  AL  |  chenwe02  |   31  |  31 |     0     |     31    |  31 |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
| clevest01 |  BAL   |   E   |  2015  |   BAL    |  AL  | clevest01  |   30  |  24 |     30    |     10    |  0  |  9  |  1   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  18  |  4   |  0   |
| davisch02 |  BAL   |   E   |  2015  |   BAL    |  AL  | davisch02  |  160  | 159 |    160    |    138    |  0  |  0  | 111  |  0   |  0   |  0   |  0   |  0   |  30  |  30  |  22  |  0   |  0   |
| deazaal01 |  BAL   |   E   |  2015  |   BAL    |  AL  | deazaal01  |   30  |  27 |     30    |     27    |  0  |  0  |  0   |  0   |  0   |  0   |  19  |  0   |  13  |  27  |  0   |  3   |  0   |
| drakeol01 |  BAL   |   E   |  2015  |   BAL    |  AL  | drakeol01  |   13  |  0  |     1     |     13    |  13 |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
| flahery01 |  BAL   |   E   |  2015  |   BAL    |  AL  | flahery01  |   91  |  81 |     91    |     90    |  0  |  0  |  11  |  56  |  8   |  15  |  1   |  0   |  5   |  6   |  0   |  2   |  3   |
| garcija03 |  BAL   |   E   |  2015  |   BAL    |  AL  | garcija03  |   21  |  0  |     3     |     21    |  21 |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
| gausmke01 |  BAL   |   E   |  2015  |   BAL    |  AL  | gausmke01  |   25  |  17 |     1     |     25    |  25 |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
| givenmy01 |  BAL   |   E   |  2015  |   BAL    |  AL  | givenmy01  |   22  |  0  |     1     |     22    |  22 |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
| gonzami03 |  BAL   |   E   |  2015  |   BAL    |  AL  | gonzami03  |   26  |  26 |     1     |     26    |  26 |  0  |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |  0   |
+-----------+--------+-------+--------+----------+------+------------+-------+-----+-----------+-----------+-----+-----+------+------+------+------+------+------+------+------+------+------+------+
Truncated to displaylimit of 15.

In [33]:
%%sql
CREATE OR REPLACE VIEW bball_tree AS
SELECT DISTINCT a.playerid, a.teamid, t.divid, a.lgid, a.yearid
  FROM Appearances a NATURAL JOIN Teams t;

Running query in 'postgresql://localhost:5432/baseball'

++
||
++
++

### Revisiting the Home Run Query

Recall our old home run query:

In [34]:
%%sql
SELECT namefirst, namelast, yearid,
       MIN(hr), MAX(hr), AVG(hr), STDDEV(hr), SUM(hr)
FROM batting b, people p
WHERE b.playerid = p.playerid
GROUP BY namelast, namefirst, yearid
ORDER BY max DESC
LIMIT 10;

Running query in 'postgresql://localhost:5432/baseball'

10 rows affected.

+-----------+----------+--------+-----+-----+---------------------+--------+-----+
| namefirst | namelast | yearid | min | max |         avg         | stddev | sum |
+-----------+----------+--------+-----+-----+---------------------+--------+-----+
|   Barry   |  Bonds   |  2001  |  73 |  73 | 73.0000000000000000 |  None  |  73 |
|    Mark   | McGwire  |  1998  |  70 |  70 | 70.0000000000000000 |  None  |  70 |
|   Sammy   |   Sosa   |  1998  |  66 |  66 | 66.0000000000000000 |  None  |  66 |
|    Mark   | McGwire  |  1999  |  65 |  65 | 65.0000000000000000 |  None  |  65 |
|   Sammy   |   Sosa   |  2001  |  64 |  64 | 64.0000000000000000 |  None  |  64 |
|   Sammy   |   Sosa   |  1999  |  63 |  63 | 63.0000000000000000 |  None  |  63 |
|   Roger   |  Maris   |  1961  |  61 |  61 | 61.0000000000000000 |  None  |  61 |
|    Babe   |   Ruth   |  1927  |  60 |  60 | 60.0000000000000000 |  None  |  60 |
|    Babe   |   Ruth   |  1921  |  59 |  59 | 59.0000000000000000 |  None  |  59 |
| Giancarlo | Stanton  |  2017  |  59 |  59 | 59.0000000000000000 |  None  |  59 |
+-----------+----------+--------+-----+-----+---------------------+--------+-----+

Set up for roll up/drill down on `bball_tree` hierarchy.
* Join each (raw) person with the associated `bball_tree` entry by `(playerid, yearid)` in a CTE
* Use this result for roll-up and drill-down.

<br/><br/><br/><br/><br/>
<br/><br/><br/><br/><br/>
<br/><br/><br/><br/><br/>
<br/><br/><br/><br/><br/>

In [35]:
%%sql
WITH batting_tree AS
(
    SELECT b.*, t.divid
    FROM batting b, bball_tree t
    WHERE b.playerid = t.playerid
      AND b.yearid = t.yearid
)
SELECT namefirst, namelast,
       bt.teamid, bt.lgid, bt.divid, bt.yearid,
       MIN(hr), MAX(hr), AVG(hr), STDDEV(hr), SUM(hr)
FROM batting_tree bt, people p
WHERE bt.playerid = p.playerid
GROUP BY bt.playerid, bt.teamid, bt.lgid, bt.divid, bt.yearid, namelast, namefirst
ORDER BY max DESC
LIMIT 10;

Running query in 'postgresql://localhost:5432/baseball'

10 rows affected.

+-----------+----------+--------+------+-------+--------+-----+-----+---------------------+--------+-----+
| namefirst | namelast | teamid | lgid | divid | yearid | min | max |         avg         | stddev | sum |
+-----------+----------+--------+------+-------+--------+-----+-----+---------------------+--------+-----+
|   Barry   |  Bonds   |  SFN   |  NL  |   W   |  2001  |  73 |  73 | 73.0000000000000000 |  None  |  73 |
|    Mark   | McGwire  |  SLN   |  NL  |   C   |  1998  |  70 |  70 | 70.0000000000000000 |  None  |  70 |
|   Sammy   |   Sosa   |  CHN   |  NL  |   C   |  1998  |  66 |  66 | 66.0000000000000000 |  None  |  66 |
|    Mark   | McGwire  |  SLN   |  NL  |   C   |  1999  |  65 |  65 | 65.0000000000000000 |  None  |  65 |
|   Sammy   |   Sosa   |  CHN   |  NL  |   C   |  2001  |  64 |  64 | 64.0000000000000000 |  None  |  64 |
|   Sammy   |   Sosa   |  CHN   |  NL  |   C   |  1999  |  63 |  63 | 63.0000000000000000 |  None  |  63 |
|   Roger   |  Maris   |  NYA   |  AL  |  None |  1961  |  61 |  61 | 61.0000000000000000 |  None  |  61 |
|    Babe   |   Ruth   |  NYA   |  AL  |  None |  1927  |  60 |  60 | 60.0000000000000000 |  None  |  60 |
|    Babe   |   Ruth   |  NYA   |  AL  |  None |  1921  |  59 |  59 | 59.0000000000000000 |  None  |  59 |
| Giancarlo | Stanton  |  MIA   |  NL  |   E   |  2017  |  59 |  59 | 59.0000000000000000 |  None  |  59 |
+-----------+----------+--------+------+-------+--------+-----+-----+---------------------+--------+-----+

# [Extra] Load in the database from scratch

We download the database, unzip it, load it into pandas, then export to a new database via `jupysql` cell magic.

**CAUTION**: This may crash your DataHub instance. The file is pretty big....

The direct zip download of this file is [here](https://geonames.usgs.gov/docs/stategaz/NationalFile.zip).

In [ ]:
# first download and unzip the data
!mkdir -p data
!wget https://geonames.usgs.gov/docs/stategaz/NationalFile.zip -P data/
!unzip -u data/NationalFile.zip -d data/

In [ ]:
import os
fname = os.path.join("data", "NationalFile_20210825.txt")
fname

In [ ]:
!du -h {fname} # big file

In [ ]:
!head -c 1024 {fname}

In [ ]:
# next, load it into pandas
import pandas as pd

national = pd.read_csv("data/NationalFile_20210825.txt", delimiter="|")
national.head(2)

In [ ]:
national = national.rename(columns=dict([(col, col.lower().strip()) for col in national.columns]))
national.head(2)

Next, get a table sample in pandas.

In [ ]:
import numpy as np

p = 0.005 # fraction, not percentage

np.random.seed(42)
national['keep_bool'] = np.random.random(len(national)) < p
national['keep_bool'].value_counts()

In [ ]:
national = national[national['keep_bool']].drop(columns=['keep_bool'])
national

Now, export to SQL

In [ ]:
!psql -h localhost -d gnis -c 'SELECT pg_terminate_backend(pg_stat_activity.pid) FROM pg_stat_activity WHERE datname = current_database() AND pid <> pg_backend_pid();'
!psql -h localhost -c 'DROP DATABASE IF EXISTS gnis'
!psql -h localhost -c 'CREATE DATABASE gnis'

In [ ]:
%reload_ext sql
%sql postgresql://127.0.0.1:5432/gnis

In [ ]:
%sql --persist-replace national

In [ ]:
%sql ALTER TABLE national DROP COLUMN index;

Now, export to file with `pgdump`

In [ ]:
!pg_dump -h localhost --encoding utf8 gnis -f data/gnis.sql

Finally, run the beginning of this notebook again

In [ ]:
!du -h data/gnis.sql

## FIPS

Federal Information Processing System (FIPS) Codes for States and Counties

Manually download the file from this link (https://transition.fcc.gov/oet/info/maps/census/fips/fips.txt) and save it in `data/`.
* `wget` does not work here; likely the FCC website only accepts HTTPS connections to deter from server attacks.

In [ ]:
!wget https://transition.fcc.gov/oet/info/maps/census/fips/fips.txt -P data/

In [ ]:
import pandas as pd
import re

In [ ]:
with open('data/fips.txt', 'r') as f:
    lines = f.readlines()

In [ ]:
COUNTY_STARTS = 69
OFFSET = 3 # the start of the data itself, after headers

In [ ]:
re.match('\s+(\d+)\s+(\w+)', lines[COUNTY_STARTS+3]).groups()

In [ ]:
splits = [re.match('\s+(\d+)\s+(.*)', line).groups()
          for line in 
          lines[COUNTY_STARTS+OFFSET:]]
splits[0]

**For later**: There is a significant discrepancy between the number of counties created and the number of lines remaining in our dataset. We encourage you to investigate this!

In [ ]:
len(lines), len(splits)

> FIPS codes are numbers which uniquely identify geographic areas.  The number of 
digits in FIPS codes vary depending on the level of geography.  State-level FIPS
codes have two digits, county-level FIPS codes have five digits of which the 
first two are the FIPS code of the state to which the county belongs.  When 
using the list below to look up county FIPS codes, it is advisable to first look
up the FIPS code for the state to which the county belongs.  This will help you
identify the right section of the list while scrolling down, which can be
important since there are over 3000 counties and county-equivalents (e.g.
independent cities, parishes, boroughs) in the United States.

In [ ]:
fips_counties = pd.DataFrame(data=splits, columns=['fips', 'county'])
fips_counties['state_numeric'] = fips_counties['fips'].str[:2].astype(int)
fips_counties['fips'] = fips_counties['fips'].astype(int)
fips_counties = fips_counties.set_index('fips')
fips_counties

In [ ]:
%reload_ext sql
%sql postgresql://127.0.0.1:5432/gnis

In [ ]:
%sql --persist-replace fips_counties

Now, export to file with `pgdump`. This exports both `national` and `fips_counties` relations to the same `gnis.sql` database dump.

In [ ]:
!pg_dump -h localhost --encoding utf8 gnis -f data/gnis.sql

Finally, run the beginning of this notebook again

In [ ]:
!du -h data/gnis.sql